# 06.09  наука о данных

JOEL BRUS-книга Data science from scratch

наука данных (data science) - это наука связанное с данными (обработка,сбор, анализ и поиском эффективных решений на основе данных
Дфтф - сайентисты собирают неструктурированные данные, анализируют их с помощью мат.моделей и делают из них выводы

план этапов в обработке
1. *Сбор* Каждый раз нужно определить объем и структуру данных и собрать их в удобной для обработки форме. Нужно определиться с целями анализа данных и подобрать нужные методы для следующих этапов.

2. *Подготовка* Включает создание архитектуры базы данных и системы их хранения, проверку и очистку от нерелевантных значений (валидацию).

3. *Обработка* На этом этапе проводятся кластеризация и классификация (разделение на выборки и группы), применяются математические модели и программные методы, например машинное обучение.

4. *Анализ* Дата-сайентист изучает результаты моделирования и ищет ответы на изначальные гипотезы, проводит качественный и количественный анализ. Например, находит ошибки в бизнес-процессах или прогнозирует поведение данных в будущем.

5. *Коммуникация* Включает визуализацию данных, создание аналитических отчетов и предложений: какие решения на основе данных можно принять, чтобы бизнес работал эффективнее.

Основные термины
**BIG DATA** (большие данные) — гигантские массивы информации, которую генерируют большие информационные системы, например соцсети и сотовая связь.

*Математическое моделирование — использование математики и статистики для поиска закономерностей в данных. 
Например, временные ряды (графики изменения величин во времени) анализируют с помощью регрессионных моделей, которые помогают найти 
зависимости между переменными.

**Data Mining** (добыча или интеллектуальный анализ данных) — процесс поиска неизвестных ранее закономерностей (паттернов) и полезных знаний в 
больших базах «сырых» данных. Например, банк имеет базу данных о всех транзакциях клиентов, но ничего не знает о возможных преступниках среди них. 
Data Mining может помочь найти среди миллионов клиентов тех, кто получает переводы из сомнительных источников.

**Tree-based-алгоритмы** — использование метода «дерева решений» в Data Mining. Метод классифицирует данные по принадлежности к определенным признакам, 
пока у каждого блока данных не будет значения по каждому признаку. Например, всех клиентов банка можно классифицировать по полу, возрасту и среднему
доходу. Это поможет найти мужчин 18–50 лет с высоким доходом, которым можно предложить скидку на элитный фитнес-центр от партнера.

**Machine Learning** (машинное обучение) — это наука, которая занимается изучением алгоритмов для работы с данными, чтобы автоматизировать в дальнейшем
процесс обработки новых данных. Например, зная всех клиентов банка, которые выплатили кредиты и которые не смогли выплатить, мы можем построить такую
модель, которая будет решать, каким клиентам стоит выдавать деньги. Такая задача называется задачей классификации.

**Feature Engineering** (конструирование признаков) — процесс подготовки необработанных данных для обучения ML-моделей. 
Чтобы модели было легче обучаться, нужно выделить из данных новые признаки, например добавить новый признак клиенту на основе усреднения суммы
его покупок (средний чек).
Deep Learning (глубокое обучение) — метод машинного обучения с использованием сложных многослойных нейронных сетей.

# introduction to data science

Необходимые инструменты для Data Science

	1.	Языки программирования: Python  — самые популярные.
	
    2.	Библиотеки Python:
	•	pandas — для работы с табличными данными.
	•	NumPy — для числовых вычислений.
	•	matplotlib и seaborn — для визуализации.
	•	scikit-learn — для машинного обучения.
	•	TensorFlow и PyTorch — для работы с нейронными сетями.
	
 
    3.	SQL — для работы с базами данных.
	
    4.	Jupyter Notebook — среда для написания и выполнения кода с визуализацией результатов анализа.

	5.	Практика:
	•	Kaggle — платформа для соревнований по анализу данных, где можно решать реальные задачи и соревноваться с другими специалистами.

Заключение

Наука о данных — это динамично развивающаяся область, которая востребована в разных отраслях: от медицины до маркетинга. Для того чтобы стать специалистом в этой сфере, важно владеть основными инструментами и методами анализа данных, понимать статистику и быть готовым к постоянному обучению.

# Основные команды для работы с данными в Pandas

В Data Science работа с данными обычно начинается с загрузки данных в DataFrame, что позволяет легко их анализировать и обрабатывать. Ниже приведены основные команды для работы с Pandas DataFrame в Python.

In [3]:
#  1. Создание DataFrame

import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

 2. Первичный обзор данных

Для того чтобы посмотреть на начало и конец данных, используются следующие команды:

	•	df.head() — отображает первые 5 строк DataFrame.
	•	df.tail() — отображает последние 5 строк DataFrame.

 Вы можете указать число строк, которое хотите увидеть:

• df.head(10)                    # Покажет первые 10 строк
• df.tail(3)                     # Покажет последние 3 строки

Пример:

In [5]:
df.head()  # Показывает первые 5 строк
df.tail()  # Показывает последние 5 строк

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

3. Информация о DataFrame

	•	df.info() — выведет информацию о DataFrame: типы данных, количество ненулевых значений и использование памяти.

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [7]:
# •	df.describe() — выводит основные статистические характеристики числовых столбцов: среднее, медиана, стандартное отклонение и т.д.
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [8]:
#            4. Получение данных из DataFrame
#        	df[‘column_name’] — извлекает данные по отдельному столбцу.

df['Age']  # Доступ к столбцу Age

0    25
1    30
2    35
Name: Age, dtype: int64

In [9]:
# df[[‘column1’, ‘column2’]] — доступ к нескольким столбцам сразу.

df[['Name', 'City']]  # Доступ к двум столбцам

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [14]:
df.loc[0]    #доступ к строкам
df.loc[:, 'Age']   # доступ ко всем строкам столбца age

0    25
1    30
2    35
Name: Age, dtype: int64

# добавление новых столбцов
мы можем добаваить новый столбец в DataFrame выполняя простое присваивание

In [16]:
df['Country']=['USA', 'USA', 'USA'] # добавляем новый столбец country
print(df)

      Name  Age         City Country
0    Alice   25     New York     USA
1      Bob   30  Los Angeles     USA
2  Charlie   35      Chicago     USA

# фильтрация данных
для фильтрации строк можно использовать условные выражения

In [18]:
df[(df['Age']>20)&(df['City']=='New York')] #выбирает строки где возраст больше 25и город нью-йорк

    Name  Age      City Country
0  Alice   25  New York     USA

In [20]:
df[df['Age']>10] # фильтрация по возрасту

      Name  Age         City Country
0    Alice   25     New York     USA
1      Bob   30  Los Angeles     USA
2  Charlie   35      Chicago     USA

 # Сортировка данных

In [22]:
df.sort_values('Age')

      Name  Age         City Country
0    Alice   25     New York     USA
1      Bob   30  Los Angeles     USA
2  Charlie   35      Chicago     USA

In [23]:
df.sort_values(['Age', 'Name'], ascending=[True, False])  # Сначала по возрасту, затем по имени

      Name  Age         City Country
0    Alice   25     New York     USA
1      Bob   30  Los Angeles     USA
2  Charlie   35      Chicago     USA

# удаление строк и столбцов

In [2]:
import pandas as pd
# Примерные данные
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}
df = pd.DataFrame(data)  
# Удаляем столбец 'City'
df.drop('City', axis=1, inplace=True)

print("После удаления столбца 'City':")
print(df)

После удаления столбца 'City':
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40

In [3]:
# Удаляем строки с индексами 0 и 2
df.drop([0, 2], axis=0, inplace=True)

print("После удаления строк с индексами 0 и 2:")
print(df)

После удаления строк с индексами 0 и 2:
    Name  Age
1    Bob   30
3  David   40

# Метод fillna() 
в Pandas используется для замены пропущенных значений (NaN) в DataFrame на другие значения. Этот метод полезен для работы с отсутствующими данными, что часто встречается в реальных наборах данных.

1.	Заполнение пропущенных значений одним значением:

Если вы хотите заменить все пропущенные значения в DataFrame одним значением, например, нулем, используйте:

In [5]:
import pandas as pd
import numpy as np
# Создание DataFrame с пропущенными значениями (NaN)
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, np.nan, 35, 40],
        'City': ['New York', np.nan, 'Chicago', 'Houston']}
df = pd.DataFrame(data)
print(df)

      Name   Age      City
0    Alice  25.0  New York
1      Bob   NaN       NaN
2  Charlie  35.0   Chicago
3    David  40.0   Houston

In [7]:
# Заполняем пропущенные значения в столбцах числом 0
df.fillna(0, inplace=True)
print(df)

      Name   Age      City
0    Alice  25.0  New York
1      Bob   0.0         0
2  Charlie  35.0   Chicago
3    David  40.0   Houston

Заполнение пропущенных значений в отдельных столбцах разными значениями:

Вы можете заполнить пропущенные значения разными значениями для каждого столбца:

In [8]:
df.fillna({'Age': 0, 'City': 'Unknown'}, inplace=True)
print(df)

      Name   Age      City
0    Alice  25.0  New York
1      Bob   0.0         0
2  Charlie  35.0   Chicago
3    David  40.0   Houston

Заполнение пропущенных значений предыдущим или следующим значением:

Вы также можете заполнить пропущенные значения предыдущим значением из того же столбца:

In [9]:
df.fillna(method='ffill', inplace=True)  # 'ffill' (forward fill) - заполняет предыдущим значением

C:\Users\user\AppData\Local\Temp\ipykernel_12064\1344356376.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', inplace=True)  # 'ffill' (forward fill) - заполняет предыдущим значением

In [10]:
# Или следующим значением:
df.fillna(method='bfill', inplace=True)  # 'bfill' (backward fill) - заполняет следующим значением

C:\Users\user\AppData\Local\Temp\ipykernel_12064\2694381286.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill', inplace=True)  # 'bfill' (backward fill) - заполняет следующим значением

Заполнение только числовых или только строковых значений:

Вы можете выбрать только числовые столбцы для заполнения:

In [11]:
df['Age'].fillna(df['Age'].mean(), inplace=True)
print(df)

      Name   Age      City
0    Alice  25.0  New York
1      Bob   0.0         0
2  Charlie  35.0   Chicago
3    David  40.0   Houston

C:\Users\user\AppData\Local\Temp\ipykernel_12064\1644099911.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)

Основные параметры метода fillna():

	•	value: значение, которым нужно заменить пропущенные данные.
	•	method: способ заполнения (ffill, bfill).
	•	inplace: если True, изменения применяются к оригинальному DataFrame.
	•	limit: максимальное количество замен на одно заполнение.

Использование fillna() помогает подготовить данные к дальнейшему анализу или построению моделей, избегая проблем, связанных с отсутствующими значениями.